Revit 2027 API
PanelScheduleData.SetLoadClassifications Method
 Sets the Load Classifications associated with this panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLoadClassifications(
	IList<ElementId> loadClassificaions
)
Public Sub SetLoadClassifications (
	loadClassificaions As IList(Of ElementId)
)
public:
void SetLoadClassifications(
	IList<ElementId^>^ loadClassificaions
)
member SetLoadClassifications :
        loadClassificaions : IList<ElementId> -> unit
Parameters
loadClassificaions IList<ElementId>
 The load classifications to assign
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace